{
  "backend/main.mo": "Motoko backend defining schools, staff accounts, reports, and user profiles with role-based access control and CRUD operations for admin, staff, and users.",
  "feature_evidence.json": "Metadata file describing a documentation update feature, listing affected files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files, describing their purpose and functionality.",
  "frontend/index.css": "Tailwind CSS theme file defining OKLCH color variables and dark-mode styles for global UI appearance.",
  "frontend/index.html": "Base HTML file with root container and script entry point for the frontend application.",
  "frontend/README.md": "Project documentation explaining features, roles, privacy, security, and local development setup for the Inkog platform.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes for entry, student, staff, and admin pages with dark mode enabled.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI component showing an access-denied message for unauthorized staff or admin users with navigation back home.",
  "frontend/src/components/admin/SchoolFormDialog.tsx": "Dialog form component for creating or editing schools with validation and admin mutation handling.",
  "frontend/src/components/admin/StaffFormDialog.tsx": "Dialog form for creating or updating staff accounts, supporting principal assignment, school selection, and enabled status.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity authentication with loading states and query cache handling.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main layout with header, footer, and an Outlet for routed content.",
  "frontend/src/components/reports/ReportStatusActions.tsx": "Provides a dropdown for staff to update a report’s status via mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useAdmin.ts": "Admin hooks for CRUD operations on schools and staff, with query invalidation.",
  "frontend/src/hooks/useAuth.ts": "Determines authentication state, admin status, and staff account data using actor calls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, state, and context provider setup.",
  "frontend/src/hooks/useSchools.ts": "Fetches the list of schools using the actor when available.",
  "frontend/src/hooks/useStaffReports.ts": "Provides report-fetching by school and a mutation to update report status.",
  "frontend/src/hooks/useStudentReport.ts": "Defines a mutation for submitting anonymous student reports.",
  "frontend/src/index.css": "Imports global CSS definitions.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard UI for viewing stats, managing schools, and managing staff.",
  "frontend/src/pages/AdminGatePage.tsx": "Gatekeeper page that checks authentication and admin status before rendering the admin dashboard.",
  "frontend/src/pages/EntryPage.tsx": "Landing page presenting role-based navigation cards for students, staff, and admins.",
  "frontend/src/pages/StaffDashboardPage.tsx": "Staff dashboard showing filtered school reports with status controls and summary stats.",
  "frontend/src/pages/StaffGatePage.tsx": "Gatekeeper page enforcing staff authentication and routing to the staff dashboard.",
  "frontend/src/pages/StudentReportPage.tsx": "Form for students to anonymously submit reports to their school with category and text inputs.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "JSON describing the project’s versioned state, architecture notes, privacy rules, role separation, known admin‑bootstrap issue, and a list of implemented features. It also flags an admin access bug due to missing initial admin assignment."
}