{
  "backend/main.mo": "Motoko canister defining schools, staff, reports, user profiles, and access control with stable storage, upgrade hooks, and authorization mixins.",
  "feature_evidence.json": "Minimal feature evidence report file with an empty features list.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of all frontend files for reference.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and dark theme overrides.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/README.md": "Project documentation describing features, roles, setup, deployment, and architecture of the Inkog reporting system.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for entry, student, staff, and admin pages and forces dark mode.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI card shown when a user lacks staff or admin permissions with navigation back to home.",
  "frontend/src/components/admin/SchoolFormDialog.tsx": "Dialog form for creating or editing schools using admin mutations with loading states.",
  "frontend/src/components/admin/StaffFormDialog.tsx": "Dialog form for creating or editing staff accounts including principal, school assignment, and enabled toggle.",
  "frontend/src/components/auth/AuthGateErrorCard.tsx": "Error card displayed when authorization checks fail, showing the error and a retry button.",
  "frontend/src/components/auth/LoginButton.tsx": "A login/logout button using Internet Identity that manages authentication status and clears queries upon logout.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application layout with header, footer, and routed content via Outlet.",
  "frontend/src/components/reports/ReportStatusActions.tsx": "Provides a dropdown for staff to mark reports as reviewed or resolved using a status update mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Admin-focused hooks for managing schools and staff with CRUD operations and related query invalidation.",
  "frontend/src/hooks/useAuth.ts": "Determines authentication state, admin/staff roles, and exposes related loading and error info.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity persistence via a React context and AuthClient.",
  "frontend/src/hooks/useSchools.ts": "Fetches all schools through the backend actor when available.",
  "frontend/src/hooks/useStaffReports.ts": "Retrieves reports for a school and provides a mutation to update report status.",
  "frontend/src/hooks/useStudentReport.ts": "Offers a mutation for submitting anonymous student reports and invalidates stats on success.",
  "frontend/src/index.css": "Re-exports the root index.css file.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for overview, schools, and staff, including CRUD dialogs and stats.",
  "frontend/src/pages/AdminGatePage.tsx": "Handles admin authentication and authorization flow, showing loading, login, error, access denied, or the admin dashboard depending on auth state.",
  "frontend/src/pages/EntryPage.tsx": "Landing page presenting role-based entry cards for students, staff, and admins with navigation actions.",
  "frontend/src/pages/StaffDashboardPage.tsx": "Displays staff report dashboard with filtering, statistics, and report status management for a staff member's school.",
  "frontend/src/pages/StaffGatePage.tsx": "Controls staff authentication and authorization flow, showing login, errors, disabled account notice, or the staff dashboard.",
  "frontend/src/pages/StudentReportPage.tsx": "Provides a form for students to anonymously submit reports, selecting a school and category with success feedback.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom OKLCH color palette, extended animations, and typography/container/animate plugins.",
  "project_state.json": "Project state metadata describing the app’s purpose, architecture notes, known issues, and existing feature definitions for an anonymous reporting platform."
}