{
  "kind": "build_request",
  "title": "Require password prompt on every visit to the Admin page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a password gate on the /admin route that requires the user to enter the exact password \"inmz3-jnxbo-huill-m3p3q-la3cc-j7mjp-uahne-hudzt-f6lnd-vctox-sqe\" every time they attempt to access the Admin page, before showing any admin dashboard or admin access-denied content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "just make it so I have to enter a password everytime I want to enter the admin page and the password should be this  inmz3-jnxbo-huill-m3p3q-la3cc-j7mjp-uahne-hudzt-f6lnd-vctox-sqe"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /admin always shows a password entry screen first (even if the user is already authenticated with Internet Identity and/or already an admin).",
        "Entering an incorrect password keeps the user on the password screen and shows an English error message indicating the password is incorrect.",
        "Entering the correct password allows the user to proceed to the existing admin authentication/authorization flow (Login UI if not authenticated, admin dashboard if authorized, error/denied screens as appropriate).",
        "The password is not persisted in sessionStorage/localStorage/URL parameters; refreshing the page or revisiting /admin requires the password again.",
        "The existing \"Emergency Access (Optional)\" token-saving UX in AdminGatePage is removed or repurposed so that admin access is controlled by the new password prompt (not by storing a token in sessionStorage)."
      ]
    }
  ],
  "constraints": [
    "Frontend files in immutablePaths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*",
    "Do not introduce additional backend canisters/services; keep backend as a single Motoko actor.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing secure server-side password verification or password hashing (this request is strictly for a password prompt gating the admin page).",
    "Changing existing admin allowlist/principal-based authorization behavior beyond adding the additional password gate."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}